package ru.softlab.efr.services.insurance.services.impl;

import org.apache.commons.lang.StringUtils;
import org.springframework.stereotype.Service;
import ru.softlab.efr.services.insurance.services.CountryService;

import java.util.HashMap;

/**
 * Статическая реализация справочника стран
 *
 * @author olshansky
 * @since 16.01.2019
 */
@Service
public class CountryServiceImpl implements CountryService {

    @Override
    public String getOKSMCodeByCountryName(String countryName) {
        HashMap<String, String> countries = new HashMap<String, String>() {{
            put("4", "Переходное Исламское Государство Афганистан");
            put("8", "Республика Албания");
            put("10", "Антарктида");
            put("12", "Алжирская Народная Демократическая Республика");
            put("16", "Американское Самоа");
            put("20", "Княжество Андорра");
            put("24", "Республика Ангола");
            put("28", "Антигуа и Барбуда");
            put("31", "Республика Азербайджан");
            put("32", "Аргентинская Республика");
            put("36", "Австралия");
            put("40", "Австрийская Республика");
            put("44", "Содружество Багамы");
            put("48", "Королевство Бахрейн");
            put("50", "Народная Республика Бангладеш");
            put("51", "Республика Армения");
            put("52", "Барбадос");
            put("56", "Королевство Бельгия");
            put("60", "Бермуды");
            put("64", "Королевство Бутан");
            put("68", "Многонациональное Государство Боливия");
            put("70", "Босния и Герцеговина");
            put("72", "Республика Ботсвана");
            put("74", "Остров Буве");
            put("76", "Федеративная Республика Бразилия");
            put("84", "Белиз");
            put("86", "Британская Территория В Индийском Океане");
            put("90", "Соломоновы Острова");
            put("92", "Британские Виргинские Острова");
            put("96", "Бруней-Даруссалам");
            put("100", "Республика Болгария");
            put("104", "Республика Союза Мьянма");
            put("108", "Республика Бурунди");
            put("112", "Республика Беларусь");
            put("116", "Королевство Камбоджа");
            put("120", "Республика Камерун");
            put("124", "Канада");
            put("132", "Республика Кабо-Верде");
            put("136", "Острова Кайман");
            put("140", "Центрально-Африканская Республика");
            put("144", "Демократическая Социалистическая Республика Шри-Ланка");
            put("148", "Республика Чад");
            put("152", "Республика Чили");
            put("156", "Китайская Народная Республика");
            put("158", "Тайвань (Китай)");
            put("162", "Остров Рождества");
            put("166", "Кокосовые (Килинг) Острова");
            put("170", "Республика Колумбия");
            put("174", "Союз Коморы");
            put("175", "Майотта");
            put("178", "Республика Конго");
            put("180", "Демократическая Республика Конго");
            put("184", "Острова Кука");
            put("188", "Республика Коста-Рика");
            put("191", "Республика Хорватия");
            put("192", "Республика Куба");
            put("196", "Республика Кипр");
            put("203", "Чешская Республика");
            put("204", "Республика Бенин");
            put("208", "Королевство Дания");
            put("212", "Содружество Доминики");
            put("214", "Доминиканская Республика");
            put("218", "Республика Эквадор");
            put("222", "Республика Эль-Сальвадор");
            put("226", "Республика Экваториальная Гвинея");
            put("231", "Федеративная Демократическая Республика Эфиопия");
            put("232", "Государство Эритрея");
            put("233", "Эстонская Республика");
            put("234", "Фарерские Острова");
            put("238", "Фолклендские Острова (Мальвинские)");
            put("239", "Южная Джорджия и Южные Сандвичевы Острова");
            put("242", "Республика Фиджи");
            put("246", "Финляндская Республика");
            put("248", "Эландские Острова");
            put("250", "Французская Республика");
            put("254", "Французская Гвиана");
            put("258", "Французская Полинезия");
            put("260", "Французские Южные Территории");
            put("262", "Республика Джибути");
            put("266", "Габонская Республика");
            put("268", "Грузия");
            put("270", "Республика Гамбия");
            put("275", "Государство Палестина");
            put("276", "Федеративная Республика Германия");
            put("288", "Республика Гана");
            put("292", "Гибралтар");
            put("296", "Республика Кирибати");
            put("300", "Греческая Республика");
            put("304", "Гренландия");
            put("308", "Гренада");
            put("312", "Гваделупа");
            put("316", "Гуам");
            put("320", "Республика Гватемала");
            put("324", "Гвинейская Республика");
            put("328", "Республика Гайана");
            put("332", "Республика Гаити");
            put("334", "Остров Херд И Острова Макдональд");
            put("336", "Папский Престол (Государство - Город Ватикан)");
            put("340", "Республика Гондурас");
            put("344", "Специальный Административный Регион Китая Гонконг");
            put("348", "Венгрия");
            put("352", "Республика Исландия");
            put("356", "Республика Индия");
            put("360", "Республика Индонезия");
            put("364", "Исламская Республика Иран");
            put("368", "Республика Ирак");
            put("372", "Ирландия");
            put("376", "Государство Израиль");
            put("380", "Итальянская Республика");
            put("384", "Республика Кот Д'Ивуар");
            put("388", "Ямайка");
            put("392", "Япония");
            put("398", "Республика Казахстан");
            put("400", "Иорданское Хашимитское Королевство");
            put("404", "Республика Кения");
            put("408", "Корейская Народно-Демократическая Республика");
            put("410", "Республика Корея");
            put("414", "Государство Кувейт");
            put("417", "Киргизская Республика");
            put("418", "Лаосская Народно-Демократическая Республика");
            put("422", "Ливанская Республика");
            put("426", "Королевство Лесото");
            put("428", "Латвийская Республика");
            put("430", "Республика Либерия");
            put("434", "Государство Ливия");
            put("438", "Княжество Лихтенштейн");
            put("440", "Литовская Республика");
            put("442", "Великое Герцогство Люксембург");
            put("446", "Специальный Административный Регион Китая Макао");
            put("450", "Республика Мадагаскар");
            put("454", "Республика Малави");
            put("458", "Малайзия");
            put("462", "Мальдивская Республика");
            put("466", "Республика Мали");
            put("470", "Республика Мальта");
            put("474", "Мартиника");
            put("478", "Исламская Республика Мавритания");
            put("480", "Республика Маврикий");
            put("484", "Мексиканские Соединенные Штаты");
            put("492", "Княжество Монако");
            put("496", "Монголия");
            put("498", "Республика Молдова");
            put("499", "Черногория");
            put("500", "Монтсеррат");
            put("504", "Королевство Марокко");
            put("508", "Республика Мозамбик");
            put("512", "Султанат Оман");
            put("516", "Республика Намибия");
            put("520", "Республика Науру");
            put("524", "Федеративная Демократическая Республика Непал");
            put("528", "Королевство Нидерландов");
            put("531", "Кюрасао");
            put("533", "Аруба");
            put("534", "Сен-Мартен (Нидерландская Часть)");
            put("535", "Бонэйр, Синт-Эстатиус И Саба");
            put("540", "Новая Каледония");
            put("548", "Республика Вануату");
            put("554", "Новая Зеландия");
            put("558", "Республика Никарагуа");
            put("562", "Республика Нигер");
            put("566", "Федеративная Республика Нигерия");
            put("570", "Республика Ниуэ");
            put("574", "Остров Норфолк");
            put("578", "Королевство Норвегия");
            put("580", "Содружество Северных Марианских Островов");
            put("581", "Малые Тихоокеанские Отдаленные Острова Соединенных Штатов");
            put("583", "Федеративные Штаты Микронезии");
            put("584", "Республика Маршалловы Острова");
            put("585", "Республика Палау");
            put("586", "Исламская Республика Пакистан");
            put("591", "Республика Панама");
            put("598", "Независимое Государство Папуа Новая Гвинея");
            put("600", "Республика Парагвай");
            put("604", "Республика Перу");
            put("608", "Республика Филиппины");
            put("612", "Питкерн");
            put("616", "Республика Польша");
            put("620", "Португальская Республика");
            put("624", "Республика Гвинея-Бисау");
            put("626", "Демократическая Республика Тимор-Лесте");
            put("630", "Пуэрто-Рико");
            put("634", "Государство Катар");
            put("638", "Реюньон");
            put("642", "Румыния");
            put("643", "Российская Федерация");
            put("646", "Руандийская Республика");
            put("652", "Сен-Бартелеми");
            put("654", "Святая Елена, Остров Вознесения, Тристан-Да-Кунья");
            put("659", "Сент-Китс и Невис");
            put("660", "Ангилья");
            put("662", "Сент-Люсия");
            put("663", "Сен-Мартен (Французская Часть)");
            put("666", "Сен-Пьер и Микелон");
            put("670", "Сент-Винсент и Гренадины");
            put("674", "Республика Сан-Марино");
            put("678", "Демократическая Республика Сан-Томе И Принсипи");
            put("682", "Королевство Саудовская Аравия");
            put("686", "Республика Сенегал");
            put("688", "Республика Сербия");
            put("690", "Республика Сейшелы");
            put("694", "Республика Сьерра-Леоне");
            put("702", "Республика Сингапур");
            put("703", "Словацкая Республика");
            put("704", "Социалистическая Республика Вьетнам");
            put("705", "Республика Словения");
            put("706", "Федеративная Республика Сомали");
            put("710", "Южно-Африканская Республика");
            put("716", "Республика Зимбабве");
            put("724", "Королевство Испания");
            put("728", "Республика Южный Судан");
            put("729", "Республика Судан");
            put("732", "Западная Сахара");
            put("740", "Республика Суринам");
            put("744", "Шпицберген И Ян Майен");
            put("748", "Королевство Свазиленд");
            put("752", "Королевство Швеция");
            put("756", "Швейцарская Конфедерация");
            put("760", "Сирийская Арабская Республика");
            put("762", "Республика Таджикистан");
            put("764", "Королевство Таиланд");
            put("768", "Тоголезская Республика");
            put("772", "Токелау");
            put("776", "Королевство Тонга");
            put("780", "Республика Тринидад И Тобаго");
            put("784", "Объединенные Арабские Эмираты");
            put("788", "Тунисская Республика");
            put("792", "Турецкая Республика");
            put("795", "Туркменистан");
            put("796", "Острова Теркс И Кайкос");
            put("798", "Тувалу");
            put("800", "Республика Уганда");
            put("804", "Украина");
            put("807", "Республика Македония");
            put("818", "Арабская Республика Египет");
            put("826", "Соединенное Королевство Великобритании И Северной Ирландии");
            put("831", "Гернси");
            put("832", "Джерси");
            put("833", "Остров Мэн");
            put("834", "Объединенная Республика Танзания");
            put("840", "Соединенные Штаты Америки");
            put("850", "Виргинские Острова Соединенных Штатов");
            put("854", "Буркина-Фасо");
            put("858", "Восточная Республика Уругвай");
            put("860", "Республика Узбекистан");
            put("862", "Боливарианская Республика Венесуэла");
            put("876", "Уоллис и Футуна");
            put("882", "Независимое Государство Самоа");
            put("887", "Йеменская Республика");
            put("894", "Республика Замбия");
            put("895", "Республика Абхазия");
            put("896", "Республика Южная Осетия");
        }};

        if (StringUtils.isNotBlank(countryName)) {
            if (countryName.equalsIgnoreCase("Россия") || countryName.toUpperCase().contains("RUSSIA")) {
                return "643";
            }
            if (countries.entrySet().stream().anyMatch(entry -> entry.getValue().equalsIgnoreCase(countryName)
                    || entry.getValue().toUpperCase().contains(countryName.toUpperCase()))) {
                return countries.entrySet()
                        .stream()
                        .filter(entry -> entry.getValue().equalsIgnoreCase(countryName)
                                || entry.getValue().toUpperCase().contains(countryName.toUpperCase()))
                        .findFirst()
                        .get()
                        .getKey();
            }
        }
        return null;
    }
}
